Repository: joelmandell/Jasba
Catalog: src/SBAPro.WebApp/Resources/SharedResources.*.resx
Languages: sv

source: Loading...
sv: Laddar...

source: Save
sv: Spara

source: Cancel
sv: Avbryt

source: Edit
sv: Redigera

source: Delete
sv: Ta bort

source: Create
sv: Skapa

source: Upload
sv: Ladda upp

source: Back
sv: Tillbaka

source: Close
sv: Stäng

source: Name
sv: Namn

source: Description
sv: Beskrivning

source: Email
sv: E-post

source: Password
sv: Lösenord

source: Confirm Password
sv: Bekräfta lösenord

source: Submit
sv: Skicka

source: Yes
sv: Ja

source: No
sv: Nej

source: Home
sv: Hem

source: Rounds
sv: Ronder

source: Login
sv: Logga in

source: Logout
sv: Logga ut

source: Register
sv: Registrera

source: Tenants
sv: Hyresgäster

source: Manage Tenants
sv: Hantera hyresgäster

source: Sites
sv: Platser

source: My Sites
sv: Mina platser

source: Floor Plans
sv: Planlösningar

source: Object Types
sv: Objekttyper

source: Inspection Object Types
sv: Inspektionsobjekttyper

source: Inspection Rounds
sv: Inspektionsrundor

source: Start Inspection
sv: Starta inspektion

source: My Inspections
sv: Mina inspektioner

# LoginTitle
source: Login
sv: Logga in

# RegisterTitle
source: Register New Account
sv: Registrera nytt konto

source: Remember me
sv: Kom ihåg mig

source: Access Denied
sv: Åtkomst nekad

# AccessDeniedMessage
source: You do not have permission to access this page.
sv: Du har inte behörighet att komma åt denna sida.

source: Tenant Name
sv: Hyresgästnamn

source: Company Name
sv: Företagsnamn

source: Contact Email
sv: Kontakt e-post

source: Admin Email
sv: Administratörs e-post

source: Admin Password
sv: Administratörs lösenord

source: Create Tenant
sv: Skapa hyresgäst

source: Create New Tenant
sv: Skapa ny hyresgäst

source: Site Name
sv: Platsnamn

source: Address
sv: Adress

source: Create Site
sv: Skapa plats

source: Create New Site
sv: Skapa ny plats

source: Manage Floor Plans
sv: Hantera planlösningar

source: Back to Sites
sv: Tillbaka till platser

source: Floor Plan
sv: Planlösning

source: Upload Floor Plan
sv: Ladda upp planlösning

source: Floor Plan Image
sv: Planlösningsbild

source: Size
sv: Storlek

source: objects
sv: Objekt

source: Manage Objects
sv: Hantera objekt

source: Re-upload Image
sv: Ladda upp ny bild

source: Re-upload Floor Plan Image
sv: Ladda upp ny planlösningsbild

# ReUploadInfo
source: The new image will replace the existing one. All inspection objects will be preserved with their current positions.
sv: Den nya bilden ersätter den befintliga. Alla inspektionsobjekt kommer att bevaras med sina nuvarande positioner.

# ReUploadingFor
source: Re-uploading image for:
sv: Laddar upp ny bild för:

source: Update Image
sv: Uppdatera bild

# SelectedFile
source: Selected:
sv: Vald:

source: Edit Floor Plan
sv: Redigera planlösning

# ClickToPlaceObjects
source: Click on the map to place inspection objects
sv: Klicka på kartan för att placera inspektionsobjekt

source: Add Inspection Object
sv: Lägg till inspektionsobjekt

source: Object Type
sv: Objekttyp

source: Select type...
sv: Välj typ...

# NoObjectsYet
source: No objects yet. Click on the map to add one.
sv: Inga objekt ännu. Klicka på kartan för att lägga till ett.

source: Add New Type
sv: Lägg till ny typ

source: Create New Object Type
sv: Skapa ny objekttyp

source: Edit Object Type
sv: Redigera objekttyp

source: Icon
sv: Ikon

# IconPlaceholder
source: emoji or symbol
sv: emoji eller symbol

source: Save Changes
sv: Spara ändringar

# DeleteConfirm
source: Are you sure you want to delete '{0}'?
sv: Är du säker på att du vill ta bort '{0}'?

# CannotDeleteInUse
source: Cannot delete this object type because it is used by {0} inspection object(s). Remove those objects first.
sv: Kan inte ta bort denna objekttyp eftersom den används av {0} inspektionsobjekt. Ta bort dessa objekt först.

# ObjectTypeCreated
source: Object type '{0}' created successfully.
sv: Objekttyp '{0}' skapades.

# ObjectTypeUpdated
source: Object type '{0}' updated successfully.
sv: Objekttyp '{0}' uppdaterades.

# ObjectTypeDeleted
source: Object type '{0}' deleted successfully.
sv: Objekttyp '{0}' togs bort.

source: Start New Round
sv: Starta ny runda

source: Select Site
sv: Välj plats

# SelectSitePlaceholder
source: Select a site...
sv: Välj en plats...

source: Select Floor Plan
sv: Välj planlösning

# SelectFloorPlanPlaceholder
source: Select a floor plan...
sv: Välj en planlösning...

# NoSitesAvailable
source: No sites available. Contact your administrator to set up sites and floor plans.
sv: Inga platser tillgängliga.

# NoFloorPlansAvailable
source: This site has no floor plans. Add floor plans first.
sv: Denna plats har inga planlösningar. Lägg till planlösningar först.

# FloorPlanHasObjects
source: This floor plan has {0} inspection objects.
sv: Denna planlösning har {0} inspektionsobjekt.

source: Start Round
sv: Starta runda

source: Execute Round
sv: Utför runda

source: Complete Round
sv: Slutför runda

source: Inspection Round
sv: Inspektionsrunda

source: Inspected by
sv: Inspekterad av

source: Comment
sv: Kommentar

source: Add comment...
sv: Lägg till kommentar...

source: Not OK
sv: Ej OK

source: Needs Action
sv: Kräver åtgärd

source: Generate Report
sv: Generera rapport

source: Successfully Created
sv: Skapades framgångsrikt

source: Successfully Updated
sv: Uppdaterades framgångsrikt

source: Successfully Deleted
sv: Togs bort framgångsrikt

# ErrorOccurred
source: An error occurred
sv: Ett fel uppstod

source: Invalid email or password.
sv: Ogiltig e-postadress eller lösenord.

source: Demo credentials:
sv: Demo-inloggningsuppgifter:

source: Tenant Management
sv: Hyresgästhantering

source: Users
sv: Användare

source: Start Inspection Round
sv: Starta inspektionsrunda

source: Start New Inspection Round
sv: Starta ny inspektionsrunda

source: Select Site and Floor Plan
sv: Välj plats och planlösning

source: Loading sites...
sv: Laddar platser...

source: Select a site...
sv: Välj en plats...

source: Select a floor plan...
sv: Välj en planlösning...

# NoFloorPlans
source: This site has no floor plans. Ask your administrator to upload floor plans.
sv: Denna plats har inga planlösningar. Be din administratör att ladda upp planlösningar.

source: Ready to start!
sv: Redo att starta!

# ThisFloorPlanHasObjects
source: This floor plan has {0} inspection objects.
sv: Denna planlösning har {0} inspektionsobjekt.

source: Welcome to
sv: Välkommen till

# SystematicFireSafety
source: Systematiskt Brandskyddsarbete - Professional Fire Safety Management System
sv: Systematiskt Brandskyddsarbete - Professionellt Brandsäkerhetssystem

source: Logged in as:
sv: Inloggad som:

source: Tenant:
sv: Hyresgäst:

source: System Administrator
sv: Systemadministratör

# ManageTenantsAndSystem
source: Manage tenants and system configuration
sv: Hantera hyresgäster och systemkonfiguration

source: Site Management
sv: Platshantering

# ManageSitesAndFloorPlans
source: Manage your sites and floor plans
sv: Hantera dina platser och planlösningar

source: Manage Sites
sv: Hantera platser

source: Inspections
sv: Inspektioner

# PerformAndViewInspections
source: Perform and view inspection rounds
sv: Utför och visa inspektionsrundor

source: View Inspections
sv: Visa inspektioner

source: Please login to continue.
sv: Vänligen logga in för att fortsätta.

source: About SBA Pro
sv: Om SBA Pro

# AboutDescription
source: SBA Pro is a comprehensive, cloud-based SaaS system for managing Systematic Fire Protection Work (SBA). It helps property owners and operators comply with Swedish legislation (LSO 2003:778).
sv: SBA Pro är ett omfattande, molnbaserat SaaS-system för hantering av Systematiskt Brandskyddsarbete (SBA). Det hjälper fastighetsägare och operatörer att följa svensk lagstiftning (LSO 2003:778).

# MultiTenantArchitecture
source: Multi-tenant architecture for secure data isolation
sv: Multitenantarkitektur för säker dataisolering

# InteractiveFloorPlan
source: Interactive floor plan visualization with Leaflet.js
sv: Interaktiv planlösningsvisualisering med Leaflet.js

# AutomatedReporting
source: Automated inspection reporting and reminders
sv: Automatiserad inspektionsrapportering och påminnelser

# ProfessionalPDFReports
source: Professional PDF reports with QuestPDF
sv: Professionella PDF-rapporter med QuestPDF

# OfflineCapable
source: Offline-capable for inspections in areas with poor connectivity
sv: Offlinekompatibel för inspektioner i områden med dålig anslutning

# NoRoundsFound
source: No inspection rounds found. Click "Start New Round" to begin your first inspection.
sv: Inga inspektionsrundor hittades. Klicka på "Starta ny runda" för att påbörja din första inspektion.

source: Started
sv: Startad

source: Completed
sv: Slutförd

source: In Progress
sv: Pågående

source: Results
sv: Resultat

source: Actions
sv: Åtgärder

source: Continue
sv: Fortsätt

# DownloadPDFReport
source: ðŸ“„ Download PDF Report
sv: 📄 Ladda ner PDF-rapport

source: items
sv: objekt

source: Execute Inspection
sv: Utför inspektion

source: Loading inspection round
sv: Laddar inspektionsrunda...

# ClickObjectsToInspect
source: Click on objects to inspect
sv: Klicka på objekt för att inspektera

source: Save Inspection
sv: Spara inspektion

source: Progress
sv: Framsteg

source: objects inspected
sv: {0} av {1} objekt inspekterade

source: optional
sv: valfritt

source: All objects inspected!
sv: Alla objekt inspekterade!

source: Add New Site
sv: Lägg till ny plats

source: Mobile Inspection
sv: Mobil Besiktning

source: Welcome
sv: Välkommen

# MobileInspectionDescription
source: Conduct inspections directly from your mobile device
sv: Genomför besiktningar direkt från din mobila enhet

source: My Rounds
sv: Mina Ronder

# ViewAndExecuteRounds
source: View and execute your inspection rounds
sv: Visa och genomför dina besiktningsronder

source: No active rounds
sv: Inga aktiva ronder

source: Inspection round not found
sv: Besiktningsrunda hittades inte

source: Enter comment...
sv: Ange kommentar...

source: Select Floor
sv: Välj våning

source: All Floors
sv: Alla våningar

source: Photo
sv: Foto

source: Remove Photo
sv: Ta bort foto

source: Photo uploaded
sv: Foto uppladdad

source: Photo upload failed
sv: Foto uppladdning misslyckades

source: Photo removed
sv: Foto borttaget

# PhotoTooLarge
source: Photo is too large (max 5MB)
sv: Fotot är för stort (max 5MB)
